OpenNuvoton/M451BSP/SampleCode/StdDriver/USBH_UAC_LOOPBACK/main.c
    UAC_Init();

    while(1)
    {
        if (USBH_ProcessHubEvents())              /* USB Host port detect polling and management */
        {
        	/*
        	 *  Has hub port event. 
        	 */
        	
        	uac_dev = UAC_GetDeviceList();
        	if (uac_dev == NULL)
                continue;

            if (uac_dev != NULL)                  /* should be newly connected UAC device        */
            {
            	UAC_StartDevice(uac_dev);
            	
    			uac_control_example(uac_dev);

    			if (UAC_InstallIsoInCbFun(uac_dev, audio_in_callback) != UAC_RET_OK)
    			{
        			printf("Failed to install audio-in callback function!\n");
        			goto err_out;
    			}

    			if (UAC_InstallIsoOutCbFun(uac_dev, audio_out_callback) != UAC_RET_OK)
    			{
        			printf("Failed to install audio-out callback function!\n");
        			goto err_out;
    			}
    			
    			ResetAudioLoopBack();

    			UAC_StartIsoInPipe(uac_dev);

    			UAC_StartIsoOutPipe(uac_dev);
            }
        }
        
        if (uac_dev == NULL) {
        	ResetAudioLoopBack();
            continue;
        }
        
    	if (!kbhit())
    	{
    		ch = GetChar();
    
    		if ((ch == '+') && (vol_cur + vol_res <= vol_max))
    		{
    			printf("+");
    			val16 = vol_cur+vol_res;
        		if (UAC_VolumeControl(uac_dev, UAC_MICROPHONE, UAC_SET_CUR, UAC_CH_MASTER, &val16) == UAC_RET_OK)
        		{
            		printf("    Microphone set volume 0x%x success.\n", val16);
            		vol_cur = val16;
            	}
            	else
            		printf("    Failed to set microphone volume 0x%x!\n", val16);
            }
    		else if ((ch == '-') && (vol_cur - vol_res >= vol_min))
    		{
    			printf("-");
    			val16 = vol_cur-vol_res;
        		if (UAC_VolumeControl(uac_dev, UAC_MICROPHONE, UAC_SET_CUR, UAC_CH_MASTER, &val16) == UAC_RET_OK)
        		{
            		printf("    Microphone set volume 0x%x success.\n", val16);
            		vol_cur = val16;
            	}
            	else
            		printf("    Failed to set microphone volume 0x%x!\n", val16);
            }
    		else if ((ch == '0') && (vol_cur - vol_res >= vol_min))
    		{
        		if (UAC_VolumeControl(uac_dev, UAC_MICROPHONE, UAC_GET_CUR, UAC_CH_MASTER, &vol_cur) == UAC_RET_OK)
            		printf("    Microphone current volume is 0x%x.\n", vol_cur);
        		else
            		printf("    Failed to get microphone current volume!\n");
    		}
            else
            {
            	/* ignore this key */
            }

        }  /* end of kbhit() */
    }

err_out:
	while (1);    
}

/*** (C) COPYRIGHT 2017 Nuvoton Technology Corp. ***/

